BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/AT90PWM161.PIC
        <edc:SFRDef edc:_addr="0x21" edc:access="--n----n" edc:cname="TIMSK1" edc:nzwidth="0x8" ltx:memberofperipheral="TC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TOIE1" edc:desc="Timer/Counter1 Overflow Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="ICIE1" edc:desc="Timer/Counter1 Input Capture Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x22" edc:access="--n----n" edc:cname="TIFR1" edc:nzwidth="0x8" ltx:memberofperipheral="TC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TOV1" edc:desc="Timer/Counter1 Overflow Flag" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="ICF1" edc:desc="Input Capture Flag 1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x23" edc:access="nnnnnnnn" edc:cname="PINB" edc:nzwidth="0x8" ltx:memberofperipheral="PORTB"/>
        <edc:SFRDef edc:_addr="0x24" edc:access="nnnnnnnn" edc:cname="DDRB" edc:nzwidth="0x8" ltx:memberofperipheral="PORTB"/>
        <edc:SFRDef edc:_addr="0x25" edc:access="nnnnnnnn" edc:cname="PORTB" edc:nzwidth="0x8" ltx:memberofperipheral="PORTB"/>
        <edc:SFRDef edc:_addr="0x26" edc:access="nnnnnnnn" edc:cname="ADCSRA" edc:nzwidth="0x8" ltx:memberofperipheral="ADC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADPS" edc:desc="ADC  Prescaler Select Bits" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="ADIE" edc:desc="ADC Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADIF" edc:desc="ADC Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADATE" edc:desc="ADC Auto Trigger Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADSC" edc:desc="ADC Start Conversion" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADEN" edc:desc="ADC Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x27" edc:access="nn-nnnnn" edc:cname="ADCSRB" edc:nzwidth="0x8" ltx:memberofperipheral="ADC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADTS" edc:desc="ADC Auto Trigger Sources" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Free Running mode" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Analog Comparator" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="External Interrupt Request 0" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Timer/Counter0 Compare Match A" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="Timer/Counter0 Overflow" edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="Timer/Counter1 Compare Match B" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="Timer/Counter1 Overflow" edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="Timer/Counter1 Capture Event" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x08" edc:desc="PSC0ASY Event" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x09" edc:desc="PSC1ASY Event" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0A" edc:desc="PSC2ASY Event" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0B" edc:desc="Analog comparator 1" edc:when="(field &amp; 0xF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x0C" edc:desc="Analog comparator 2" edc:when="(field &amp; 0xF) == 0x0C"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="ADSSEN" edc:desc="ADC Single Shot Enable on PSC's Synchronisation Signals" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADNCDIS" edc:desc="ADC Noise Canceller Disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADHSM" edc:desc="ADC High Speed Mode" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x28" edc:access="nnn-nnnn" edc:cname="ADMUX" edc:nzwidth="0x8" ltx:memberofperipheral="ADC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MUX" edc:desc="Analog Channel and Gain Selection Bits" edc:nzwidth="0x4"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADLAR" edc:desc="Left Adjust Result" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REFS" edc:desc="Reference Selection Bits" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="AREF, Internal Vref turned off" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="AVCC with external capacitor at AREF pin" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Internal 2.56V Voltage Reference with external capacitor at AREF pin" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x29" edc:access="nnnnnnnn" edc:cname="PIND" edc:nzwidth="0x8" ltx:memberofperipheral="PORTD"/>
        <edc:SFRDef edc:_addr="0x2A" edc:access="nnnnnnnn" edc:cname="DDRD" edc:nzwidth="0x8" ltx:memberofperipheral="PORTD"/>
        <edc:SFRDef edc:_addr="0x2B" edc:access="nnnnnnnn" edc:cname="PORTD" edc:nzwidth="0x8" ltx:memberofperipheral="PORTD"/>
        <edc:SFRDef edc:_addr="0x2C" edc:access="nnnnnnnn" edc:cname="PINE" edc:nzwidth="0x8" ltx:memberofperipheral="PORTE"/>
        <edc:SFRDef edc:_addr="0x2D" edc:access="nnnnnnnn" edc:cname="DDRE" edc:nzwidth="0x8" ltx:memberofperipheral="PORTE"/>
        <edc:SFRDef edc:_addr="0x2E" edc:access="nnnnnnnn" edc:cname="PORTE" edc:nzwidth="0x8" ltx:memberofperipheral="PORTE"/>
        <edc:SFRDef edc:_addr="0x2F" edc:access="---nn-nn" edc:cname="PIM0" edc:nzwidth="0x8" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PEOPE0" edc:desc="End of Cycle Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEOEPE0" edc:desc="End of Enhanced Cycle Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="PEVE0A" edc:desc="External Event A Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEVE0B" edc:desc="External Event B Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x30" edc:access="nn-nnnnn" edc:cname="PIFR0" edc:nzwidth="0x8" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PEOP0" edc:desc="End of PSC0 Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PRN0" edc:desc="Ramp Number" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PEV0A" edc:desc="External Event A Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEV0B" edc:desc="External Event B Interrupt" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="POAC0A" edc:desc="PSC 0 Output A Activity" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POAC0B" edc:desc="PSC 0 Output A Activity" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x31" edc:access="nnnnnnn-" edc:cname="PCNF0" edc:nzwidth="0x8" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="PCLKSEL0" edc:desc="PSC 0 Input Clock Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POP0" edc:desc="PSC 0 Output Polarity" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMODE0" edc:desc="PSC 0 Mode" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PLOCK0" edc:desc="PSC 0 Lock" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PALOCK0" edc:desc="PSC 0 Autolock" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PFIFTY0" edc:desc="PSC 0 Fifty" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x32" edc:access="nnnnnnnn" edc:cname="PCTL0" edc:nzwidth="0x8" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRUN0" edc:desc="PSC 0 Run" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCCYC0" edc:desc="PSC0 Complete Cycle" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PBFM0" edc:desc="PSC 0 Balance Flank Width Modulation" edc:mask="0x9" edc:nzwidth="0x4"/>
              <edc:AdjustPoint edc:offset="-3"/>
              <edc:SFRFieldDef edc:cname="PAOC0A" edc:desc="PSC 0 Asynchronous Output Control A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAOC0B" edc:desc="PSC 0 Asynchronous Output Control B" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="PPRE0" edc:desc="PSC 0 Prescaler Selects" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x33" edc:access="--nnn-nn" edc:cname="PIM2" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PEOPE2" edc:desc="End of Cycle Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEOEPE2" edc:desc="End of Enhanced Cycle Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="PEVE2A" edc:desc="External Event A Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEVE2B" edc:desc="External Event B Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSEIE2" edc:desc="PSC 2 Synchro Error Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x34" edc:access="nnnnnnnn" edc:cname="PIFR2" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PEOP2" edc:desc="End of PSC2 Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PRN2" edc:desc="Ramp Number" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PEV2A" edc:desc="External Event A Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEV2B" edc:desc="External Event B Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSEI2" edc:desc="PSC 2 Synchro Error Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POAC2A" edc:desc="PSC 2 Output A Activity" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POAC2B" edc:desc="PSC 2 Output A Activity" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x35" edc:access="nnnnnnnn" edc:cname="PCNF2" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POME2" edc:desc="PSC 2 Output Matrix Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCLKSEL2" edc:desc="PSC 2 Input Clock Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POP2" edc:desc="PSC 2 Output Polarity" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMODE2" edc:desc="PSC 2 Mode" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PLOCK2" edc:desc="PSC 2 Lock" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PALOCK2" edc:desc="PSC 2 Autolock" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PFIFTY2" edc:desc="PSC 2 Fifty" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x36" edc:access="nnnnnnnn" edc:cname="PCTL2" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRUN2" edc:desc="PSC 2 Run" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCCYC2" edc:desc="PSC2 Complete Cycle" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PARUN2" edc:desc="PSC2 Auto Run" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAOC2A" edc:desc="PSC 2 Asynchronous Output Control A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAOC2B" edc:desc="PSC 2 Asynchronous Output Control B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PBFM2" edc:desc="Balance Flank Width Modulation" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PPRE2" edc:desc="PSC 2 Prescaler Selects" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x37" edc:access="nnnnnnnn" edc:cname="SPCR" edc:nzwidth="0x8" ltx:memberofperipheral="SPI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPR" edc:desc="SPI Clock Rate Selects" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="fosc/4" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="fosc/16" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="fosc/64" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="fosc/128" edc:when="(field &amp; 0x3) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="fosc/2" edc:when="(field &amp; 0x3) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="fosc/8" edc:when="(field &amp; 0x3) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="fosc/32" edc:when="(field &amp; 0x3) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="fosc/64" edc:when="(field &amp; 0x3) == 0x07"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="CPHA" edc:desc="Clock Phase" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CPOL" edc:desc="Clock polarity" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MSTR" edc:desc="Master/Slave Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DORD" edc:desc="Data Order" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPE" edc:desc="SPI Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPIE" edc:desc="SPI Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x38" edc:access="nn-----n" edc:cname="SPSR" edc:nzwidth="0x8" ltx:memberofperipheral="SPI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI2X" edc:desc="Double SPI Speed Bit" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="WCOL" edc:desc="Write Collision Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPIF" edc:desc="SPI Interrupt Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x39" edc:access="nnnnnnnn" edc:cname="GPIOR0" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GPIOR00" edc:desc="General Purpose IO Register 0 bit 0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GPIOR01" edc:desc="General Purpose IO Register 0 bit 1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GPIOR02" edc:desc="General Purpose IO Register 0 bit 2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GPIOR03" edc:desc="General Purpose IO Register 0 bit 3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GPIOR04" edc:desc="General Purpose IO Register 0 bit 4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GPIOR05" edc:desc="General Purpose IO Register 0 bit 5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GPIOR06" edc:desc="General Purpose IO Register 0 bit 6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GPIOR07" edc:desc="General Purpose IO Register 0 bit 7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x3A" edc:access="nnnnnnnn" edc:cname="GPIOR1" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GPIOR" edc:desc="General Purpose IO Register 1 bis" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x3B" edc:access="nnnnnnnn" edc:cname="GPIOR2" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GPIOR" edc:desc="General Purpose IO Register 2 bis" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x3C" edc:access="nnnnnnnn" edc:cname="EECR" edc:nzwidth="0x8" ltx:memberofperipheral="EEPROM">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EERE" edc:desc="EEPROM Read Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EEWE" edc:desc="EEPROM Write Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EEMWE" edc:desc="EEPROM Master Write Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EERIE" edc:desc="EEPROM Ready Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EEPM" edc:desc="EEPROM Programming Mode" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="EEPAGE" edc:desc="EEPROM Page Access" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NVMBSY" edc:desc="None Volatile Busy Memory Busy" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
