BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/AT90PWM161.PIC
        <edc:SFRDef edc:_addr="0x58" edc:access="nnnnnnnn" edc:cname="DACL" edc:nzwidth="0x8" ltx:memberofperipheral="DAC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DACL" edc:desc="DAC Data Register Low Byte Bits" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x59" edc:access="nnnnnnnn" edc:cname="DACH" edc:nzwidth="0x8" ltx:memberofperipheral="DAC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DACH" edc:desc="DAC Data Register High Byte Bits" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x5A" edc:access="nnnnnnnnnnnnnnnn" edc:cname="TCNT1" edc:nzwidth="0x10" ltx:memberofperipheral="TC1"/>
        <edc:AdjustPoint edc:_addr="0x5C" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x5D" edc:access="nnnnnnnnnnnnnnnn" edc:cname="SP" edc:nzwidth="0x10" ltx:memberofperipheral="CPU"/>
        <edc:SFRDef edc:_addr="0x5F" edc:access="nnnnnnnn" edc:cname="SREG" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C" edc:desc="Carry Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Z" edc:desc="Zero Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="N" edc:desc="Negative Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="V" edc:desc="Two's Complement Overflow Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S" edc:desc="Sign Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="H" edc:desc="Half Carry Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T" edc:desc="Bit Copy Storage" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I" edc:desc="Global Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x60" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR0SA" edc:nzwidth="0x10" ltx:memberofperipheral="PSC0"/>
        <edc:SFRDef edc:_addr="0x62" edc:access="nnnnnnnn" edc:cname="PFRC0A" edc:nzwidth="0x8" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRFM0A" edc:desc="PSC 0 Retrigger and Fault Mode for Part A" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="PFLTE0A" edc:desc="PSC 0 Filter Enable on Input Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV0A" edc:desc="PSC 0 Edge Level Selector on Input Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL0A" edc:desc="PSC 0 Input Select for Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCAE0A" edc:desc="PSC 0 Capture Enable Input Part A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x63" edc:access="nnnnnnnn" edc:cname="PFRC0B" edc:nzwidth="0x8" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRFM0B" edc:desc="PSC 0 Retrigger and Fault Mode for Part B" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="PFLTE0B" edc:desc="PSC 0 Filter Enable on Input Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV0B" edc:desc="PSC 0 Edge Level Selector on Input Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL0B" edc:desc="PSC 0 Input Select for Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCAE0B" edc:desc="PSC 0 Capture Enable Input Part B" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x64" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR2SA" edc:nzwidth="0x10" ltx:memberofperipheral="PSC2"/>
        <edc:SFRDef edc:_addr="0x66" edc:access="nnnnnnnn" edc:cname="PFRC2A" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRFM2A" edc:desc="PSC 2 Retrigger and Fault Mode for Part A" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="PFLTE2A" edc:desc="PSC 2 Filter Enable on Input Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV2A" edc:desc="PSC 2 Edge Level Selector on Input Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL2A" edc:desc="PSC 2 Input Select for Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCAE2A" edc:desc="PSC 2 Capture Enable Input Part A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x67" edc:access="nnnnnnnn" edc:cname="PFRC2B" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRFM2B" edc:desc="PSC 2 Retrigger and Fault Mode for Part B" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="PFLTE2B" edc:desc="PSC 2 Filter Enable on Input Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV2B" edc:desc="PSC 2 Edge Level Selector on Input Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL2B" edc:desc="PSC 2 Input Select for Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCAE2B" edc:desc="PSC 2 Capture Enable Input Part B" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x68" edc:access="nnnnnnnnnnnnnnnn" edc:cname="PICR0" edc:nzwidth="0x10" ltx:memberofperipheral="PSC0"/>
        <edc:SFRDef edc:_addr="0x6A" edc:access="nnnn-n-n" edc:cname="PSOC0" edc:nzwidth="0x8" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POEN0A" edc:desc="PSCOUT00 Output Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="POEN0B" edc:desc="PSCOUT01 Output Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="PSYNC0" edc:desc="Synchronisation out for ADC selection" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PISEL0B1" edc:desc="PSC Input Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL0A1" edc:desc="PSC Input Select" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x6B" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x6C" edc:access="nnnnnnnn" edc:cname="PICR2L" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2"/>
        <edc:SFRDef edc:_addr="0x6D" edc:access="n---nnnn" edc:cname="PICR2H" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PICR2" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PICR21" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="PCST2" edc:desc="PSC 2 Capture Software Trigger Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x6E" edc:access="nnnnnnnn" edc:cname="PSOC2" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POEN2A" edc:desc="PSCOUT20 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POEN2C" edc:desc="PSCOUT22 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POEN2B" edc:desc="PSCOUT21 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POEN2D" edc:desc="PSCOUT23 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSYNC2" edc:desc="Synchronization Out for ADC Selection" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="POS2" edc:desc="PSC 2 Output 23 Select" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x6F" edc:access="nnnnnnnn" edc:cname="POM2" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POMV2A" edc:desc="Output Matrix Output A Ramps" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="POMV2B" edc:desc="Output Matrix Output B Ramps" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x70" edc:access="nnnnnnnn" edc:cname="PCNFE2" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PISEL2B1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL2A1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV2B1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV2A1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PBFM21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PASDLK2" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
